app/Helpers/permission_helper.php

    function userHasPermission(string $permission): bool
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return false;
        }

        // Superadmin has all permissions
        $roleName = session()->get('role_name');
        if ($roleName === 'superadmin') {
            return true;
        }

        $db = Database::connect();
        $builder = $db->table('users')
            ->select('permissions.permission_key')
            ->join('role_permissions', 'role_permissions.role_id = users.role_id')
            ->join('permissions', 'permissions.id = role_permissions.permission_id')
            ->where('users.id', $userId);

        $results = $builder->get()->getResultArray();
---
SELECT `permissions`.`permission_key`
FROM `users`
JOIN `role_permissions` ON `role_permissions`.`role_id` = `users`.`role_id`
JOIN `permissions` ON `permissions`.`id` = `role_permissions`.`permission_id`
WHERE `users`.`id` = '15'