app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE   (
`username` = 'jeanette'
OR `email` = 'jeanette'
 )
 LIMIT 1
---
    public function login()
    {
        $step = $this->request->getGet('step') ?? 'username';
        $username = $this->request->getGet('username') ?? null;

        if ($this->request->getMethod() === 'POST') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
            $token    = $this->request->getPost('token');

            $user = $this->userModel
                ->groupStart()
                ->where('username', $username)
                ->orWhere('email', $username)
                ->groupEnd()
                ->first();

SELECT *
FROM `users`
WHERE `username` = 'jeanette'
OR `email` = 'jeanette'
 LIMIT 1
UPDATE `users` SET `token` = '3c53f56f730fbce8cad8e5f192d8eca8', `updated_at` = '2026-03-09 15:09:01'
WHERE `users`.`id` IN ('15')
SELECT *
FROM `users`
WHERE `username` = 'superadmin'
 LIMIT 1
---
    public function resetPasswordRequest()
    {
        $username = $this->request->getPost('username');

        if ($this->request->getMethod() === 'POST') {
            $user = $this->userModel
                ->where('username', $username)
                ->orWhere('email', $username)
                ->first();

            if ($user) {
                // Generate token and update user
                $token = bin2hex(random_bytes(16));
                $this->userModel->update($user['id'], ['token' => $token]);

                // Send email to admin
                $adminEmail = "jr.developer.novami@gmail.com";
                $subject = "Password Reset Token for User: {$user['name']}";
                $message = "
                <p>User <strong>{$user['name']}</strong> requested a password reset.</p>
                <p>Token: <strong>{$token}</strong></p>
                <p>Please share this token with the user so they can verify and reset their password.</p>";
                sendEmail($adminEmail, $subject, $message);

                // Find admin user record (example: superadmin)
                $admin = $this->userModel->where('username', 'superadmin')->first();

SELECT *
FROM `users`
WHERE `username` = 'jeanette'
OR `email` = 'jeanette'
 LIMIT 1
UPDATE `users` SET `password_hash` = '$2y$10$DGPceC7n.jZoJZmcRcjV7ei9mlGU72yxOg982vA1UIC5NZZj1F3Rq', `token` = NULL
WHERE `id` = '15'
---
    public function verifyToken()
    {
        if ($this->request->getMethod() === 'POST') {
            $username = $this->request->getPost('username');
            $token    = $this->request->getPost('token');
            $password = $this->request->getPost('new_password');
            $confirmPassword = $this->request->getPost('confirm_password');

            if ($password !== $confirmPassword) {
                return redirect()->back()->with('error', 'Passwords do not match.');
            }

            $user = $this->userModel->where('username', $username)->orWhere('email', $username)->first();
            if ($user && $user['token'] === $token) {
                log_message('debug', 'Reset password for ' . $username . ' with value: ' . $password);

                // Update password directly to avoid double hashing by model's beforeUpdate hook
                $this->db->table('users')->update([
                    'password_hash' => password_hash($password, PASSWORD_DEFAULT),
                    'token' => null
                ], ['id' => $user['id']]);

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `status` = 'inactive'
SELECT COUNT(*) AS `numrows`
FROM `documents`
SELECT COUNT(*) AS `numrows`
FROM `departments`
SELECT COUNT(*) AS `numrows`
FROM `document_types`
---
    public function dashboard()
    {
        $data = [
            'username' => session()->get('username'),
            'role_name' => session()->get('role_name')
        ];

        $userCount = $this->userModel->countAllResults();
        $data['userCount'] = $userCount;

        $activeUserCount = $this->userModel->where('status', 'active')->countAllResults();
        $data['activeUserCount'] = $activeUserCount;

        $inactiveUserCount = $this->userModel->where('status', 'inactive')->countAllResults();
        $data['inactiveUserCount'] = $inactiveUserCount;

        $documentCount = $this->documentModel->countAllResults();
        $data['documentCount'] = $documentCount;

        $departmentCount = $this->departmentModel->countAllResults();
        $data['departmentCount'] = $departmentCount;

        $documentTypeCount = $this->documentTypeModel->countAllResults();