app/Controllers/Notifications.php

SELECT `notifications`.*, `u`.`username` as `creator_name`, `r`.`username` as `recipient_name`
FROM `notifications`
JOIN `users` `u` ON `u`.`id` = `notifications`.`user_id`
JOIN `users` `r` ON `r`.`id` = `notifications`.`recipient_id`
WHERE `recipient_id` = '2'
ORDER BY `notifications`.`created_at` DESC
---
    public function index()
    {
        $filters = [
            'status' => $this->request->getGet('status'),
            'priority' => $this->request->getGet('priority'),
            'category' => $this->request->getGet('category')
        ];

        $notifications = $this->notificationModel
            ->select('notifications.*, u.username as creator_name, r.username as recipient_name')
            ->join('users u', 'u.id = notifications.user_id')
            ->join('users r', 'r.id = notifications.recipient_id')
            ->where('recipient_id', session()->get('user_id'));

        if (!empty($filters['status'])) {
            $notifications->where('notifications.status', $filters['status']);
        }
        if (!empty($filters['priority'])) {
            $notifications->where('notifications.priority', $filters['priority']);
        }
        if (!empty($filters['category'])) {
            $notifications->where('notifications.category', $filters['category']);
        }

        $data = [
            'notifications' => $notifications->orderBy('notifications.created_at', 'DESC')->findAll(),
            'filters' => $filters,
            'username' => session()->get('username'),
            'role_name' => session()->get('role_name')
        ];

SELECT *
FROM `users`
---
            $users = $userModel->where('department_id', $deptId)->findAll();
            $recipientIds = array_column($users, 'id');
        } elseif ($targetType === 'all') {
            $users = $userModel->findAll();