app/Models/NotificationModel.php

    public function getUnread($recipientId = null)
    {
        $builder = $this->where('status', 'unread');
        if ($recipientId !== null) {
            $builder->where('recipient_id', $recipientId);
        }
        return $builder->orderBy('priority', 'DESC')->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `notifications`
WHERE `status` = 'unread'
AND `recipient_id` = '15'
ORDER BY `priority` DESC, `created_at` DESC

    public function createNotification($data)
    {
        if (!is_array($data)) {
            return false;
        }
        if (isset($data['frequency']) && $data['frequency'] !== 'once') {
            $data['next_run_at'] = $this->calculateNextRun($data['frequency'], null, $data['interval_minutes'] ?? null);
        }
        $data['status'] = $data['status'] ?? 'unread';
        return $this->insert($data);
---
INSERT INTO `notifications` (`user_id`, `type`, `message`, `recipient_id`, `priority`, `status`, `created_at`, `updated_at`) VALUES ('15', 'password_reset', 'User Jeanette Burnett requested a password reset. Token sent to admin.', '1', 'high', 'unread', '2026-03-09 15:09:03', '2026-03-09 15:09:03')