app/Models/UserActivityLog.php

INSERT INTO `user_activity_logs` (`user_id`, `action`, `timestamp`, `ip_address`, `details`) VALUES ('15', 'Accessed dashboard', '2026-03-09 15:09:46', '::1', NULL)
---
    public function logActivity($userId, $action, $details = null)
    {
        $data = [
            'user_id' => $userId,
            'action' => $action,
            'timestamp' => date('Y-m-d H:i:s'),
            'ip_address' => $_SERVER['REMOTE_ADDR'] ?? '127.0.0.1',
            'details' => $details
        ];

        return $this->insert($data);