app/Models/User.php

SELECT `users`.*, `roles`.`role_name`, `roles`.`id` as `role_id`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`id` = '15'
 LIMIT 1
---
    public function getUserWithRoles($userId)
    {
        return $this->select('users.*, roles.role_name, roles.id as role_id')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->where('users.id', $userId)
            ->first();

SELECT `users`.*, `roles`.`role_name`, `departments`.`name` as `department_name`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
WHERE `users`.`role_id` != 1
ORDER BY `users`.`id` ASC
---
    public function getUsersWithRolesDepartment()
    {
        $builder = $this->select('users.*, roles.role_name, departments.name as department_name')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->join('departments', 'departments.id = users.department_id', 'left')
            ->where('users.role_id !=','1')
            ->orderBy('users.id', 'ASC');

        $roleId = session()->get('role_id');